Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/concurrent-mode-suspense_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: concurrent-mode-suspense title: Suspense for Data Fetching (Experimental) permalink: docs/concurrent-mode-suspense.html prev: concurrent-mode-intro.html next: concurrent-mode-patterns.html ---
ja: --- id: concurrent-mode-suspense title: サスペンスを使ったデータ取得（実験的機能） permalink: docs/concurrent-mode-suspense.html prev: concurrent-mode-intro.html next: concurrent-mode-patterns.html ---

source: >Caution: > >This page was about experimental features that aren't yet available in a stable release. It was aimed at early adopters and people who are curious.
ja: >警告: > > このページはアーリーアダプターや興味のある読者を対象に、安定リリースでまだ利用できない実験的機能を説明するために存在していました。

source: > >Much of the information on this page is now outdated and exists only for archival purposes.
ja: > > このページの説明のほとんどは既に古くなっており、アーカイブの目的のためだけに残しています。

source: **Please refer to the [React 18 Alpha announcement post](/blog/2021/06/08/the-plan-for-react-18.html ) for the up-to-date information.**
ja: 最新の情報については [React 18 アルファのアナウンス](/blog/2021/06/08/the-plan-for-react-18.html)を参照してください。

source: > >Before React 18 is released, we will replace this page with stable documentation.
ja: > > React 18 のリリースまでに、このページはより安定したドキュメントに置き換わる予定です。

source: React 16.6 added a `<Suspense>` component that lets you "wait" for some code to load and declaratively specify a loading state (like a spinner) while we're waiting:
ja: React 16.6 で、コードのロードを「待機」して宣言的にロード中状態（スピナーのようなもの）を指定することができる `<Suspense>` コンポーネントが追加されました。

source: Suspense for Data Fetching is a new feature that lets you also use `<Suspense>` to **declaratively "wait" for anything else, including data.** This page focuses on the data fetching use case, but it can also wait for images, scripts, or other asynchronous work.
ja: データ取得用のサスペンスは、**データも含むその他あらゆるものを宣言的に「待機」**するために `<Suspense>` を使えるようにする新機能です。このページではデータ取得のユースケースに焦点を当てて説明しますが、画像やスクリプト、あるいはその他の非同期的な作業の待機にも使えます。

source: - [What Is Suspense, Exactly?](#what-is-suspense-exactly)
ja: - [そもそもサスペンスとは何なのか？](#what-is-suspense-exactly)

source: - [What Suspense Is Not](#what-suspense-is-not)
ja: - [サスペンスは何でないのか](#what-suspense-is-not)

source: - [What Suspense Lets You Do](#what-suspense-lets-you-do) - [Using Suspense in Practice](#using-suspense-in-practice)
ja: - [サスペンスで何ができるのか](#what-suspense-lets-you-do) - [現実環境でのサスペンスの使用](#using-suspense-in-practice)

source: - [What If I Don’t Use Relay?](#what-if-i-dont-use-relay)
ja: - [Relay を使ってない場合は？](#what-if-i-dont-use-relay)

source: - [For Library Authors](#for-library-authors) - [Traditional Approaches vs Suspense](#traditional-approaches-vs-suspense)
ja: - [ライブラリ作者向け情報](#for-library-authors) - [既存アプローチ vs サスペンス](#traditional-approaches-vs-suspense)

source: - [Approach 1: Fetch-on-Render (not using Suspense)](#approach-1-fetch-on-render-not-using-suspense)
ja: - [アプローチ 1: Fetch-on-Render（サスペンス不使用）](#approach-1-fetch-on-render-not-using-suspense)

source: - [Approach 2: Fetch-Then-Render (not using Suspense)](#approach-2-fetch-then-render-not-using-suspense)
ja: - [アプローチ 2: Fetch-Then-Render（サスペンス不使用）](#approach-2-fetch-then-render-not-using-suspense)

source: - [Approach 3: Render-as-You-Fetch (using Suspense)](#approach-3-render-as-you-fetch-using-suspense) - [Start Fetching Early](#start-fetching-early)
ja: - [アプローチ 3: Render-as-You-Fetch（サスペンスを使用）](#approach-3-render-as-you-fetch-using-suspense) - [早期から取得を開始する](#start-fetching-early)

source: - [We’re Still Figuring This Out](#were-still-figuring-this-out) - [Suspense and Race Conditions](#suspense-and-race-conditions)
ja: - [まだ仕様は検討中です](#were-still-figuring-this-out) - [サスペンスと競合状態](#suspense-and-race-conditions)

source: - [Race Conditions with useEffect](#race-conditions-with-useeffect)
ja: - [`useEffect` に伴う競合状態](#race-conditions-with-useeffect)

source: - [Race Conditions with componentDidUpdate](#race-conditions-with-componentdidupdate)
ja: - [`componentDidUpdate` に伴う競合状態](#race-conditions-with-componentdidupdate)

source: - [The Problem](#the-problem)
ja: - [問題の本質](#the-problem)

source: - [Solving Race Conditions with Suspense](#solving-race-conditions-with-suspense) - [Handling Errors](#handling-errors) - [Next Steps](#next-steps)
ja: - [サスペンスで競合状態を解決する](#solving-race-conditions-with-suspense) - [エラーの処理](#handling-errors) - [次のステップ](#next-steps)

source: ## What Is Suspense, Exactly?
ja: ## そもそもサスペンスとは何なのか？

source: Suspense lets your components "wait" for something before they can render.
ja: サスペンスを使うことで、レンダー可能になる前にコンポーネントが何かを「待機」できるようになります。

source: In [this example](https://codesandbox.io/s/frosty-hermann-bztrp), two components wait for an asynchronous API call to fetch some data:
ja: [この例](https://codesandbox.io/s/frosty-hermann-bztrp)では、2 つのコンポーネントが、あるデータを取得する非同期的な API の完了を待機します：

source: **[Try it on CodeSandbox](https://codesandbox.io/s/frosty-hermann-bztrp)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/frosty-hermann-bztrp)**

source: This demo is a teaser.
ja: このデモはチラ見せです。

source: Don't worry if it doesn't quite make sense yet.
ja: まだあまり意味が分からなくても心配は要りません。

source: We'll talk more about how it works below.
ja: 以下でこれがどのように動作しているのかをお話しします。

source: Keep in mind that Suspense is more of a *mechanism*, and particular APIs like `fetchProfileData()` or `resource.posts.read()` in the above example are not very important.
ja: サスペンスは*仕組み*であり、上記の例の `fetchProfileData()` や `resource.posts.read()` といった特定の API はあまり重要ではないということを覚えておいてください。

source: If you're curious, you can find their definitions right in the [demo sandbox](https://codesandbox.io/s/frosty-hermann-bztrp).
ja: 興味があれば[デモ用サンドボックス](https://codesandbox.io/s/frosty-hermann-bztrp)に定義があります。

source: Suspense is not a data fetching library.
ja: サスペンスはデータ取得ライブラリではありません。

source: It's a **mechanism for data fetching libraries** to communicate to React that *the data a component is reading is not ready yet*.
ja: サスペンスとは**データ取得ライブラリのための仕組み**であり、*コンポーネントが読み出そうとしているデータがまだ準備できていない*と React に伝えられるようにします。

source: React can then wait for it to be ready and update the UI.
ja: これにより React はデータが準備できるまで待機してから UI を更新します。

source: At Facebook, we use Relay and its [new Suspense integration](https://relay.dev/docs/en/experimental/step-by-step).
ja: Facebook では、Relay と[新しい Suspense 連携機能](https://relay.dev/docs/en/experimental/step-by-step)を利用しています。

source: We expect that other libraries like Apollo can provide similar integrations.
ja: Apollo のような他のライブラリも似たような連携機能が提供できることを期待しています。

source: In the long term, we intend Suspense to become the primary way to read asynchronous data from components -- no matter where that data is coming from.
ja: 長期的にはサスペンスが、コンポーネントで非同期的なデータ（それがどこから来るのかに関わらず）を読み込む際の主要な方法となることを意図しています。

source: ### What Suspense Is Not {#what-suspense-is-not}
ja: ### サスペンスは何でないのか {#what-suspense-is-not}

source: Suspense is significantly different from existing approaches to these problems, so reading about it for the first time often leads to misconceptions.
ja: サスペンスはこの種の問題に対する既存のアプローチとは大きく異なっているため、初めて読んだときに誤解してしまうことがよくあります。

source: Let's clarify the most common ones:
ja: 最もよくある誤解を解いておきましょう：

source: * **It is not a data fetching implementation.
ja: * **データ取得の実装ではありません。

source: ** It does not assume that you use GraphQL, REST, or any other particular data format, library, transport, or protocol.
ja: **あなたが GraphQL、REST、その他どのような具体的なデータフォーマット、ライブラリ、転送経路、プロトコルを使っているのかについて仮定を置きません。

source: * **It is not a ready-to-use client.
ja: * **すぐに使えるクライアントではありません。

source: ** You can't "replace" `fetch` or Relay with Suspense.
ja: **`fetch` や Relay をサスペンスで「置き換える」ことはできません。

source: But you can use a library that's integrated with Suspense (for example, [new Relay APIs](https://relay.dev/docs/en/experimental/api-reference)).
ja: しかしサスペンスと統合されたライブラリを使うことはできます（例えば [Relay の新 API](https://relay.dev/docs/en/experimental/api-reference)）。

source: * **It does not couple data fetching to the view layer.** It helps orchestrate displaying the loading states in your UI, but it doesn't tie your network logic to React components.
ja: * **データ取得をビューレイヤと密結合させません。**ロード中状態をあなたの UI でうまく表示するための補助とはなりますが、React コンポーネントをネットワーク関係のロジックと結合させることはしません。

source: ### What Suspense Lets You Do {#what-suspense-lets-you-do}
ja: ### サスペンスで何ができるのか {#what-suspense-lets-you-do}

source: So what's the point of Suspense?
ja: ではサスペンスとは要するに何なのでしょうか。

source: There are a few ways we can answer this:
ja: これに対する答え方はいくつかあります：

source: * **It lets data fetching libraries deeply integrate with React.
ja: * **データ取得ライブラリが React と深く連携できるようにするためのものです。

source: ** If a data fetching library implements Suspense support, using it from React components feels very natural.
ja: **データ取得ライブラリがサスペンスをサポートすることで、React コンポーネントからそれを非常に自然に扱えるようになります。

source: * **It lets you orchestrate intentionally designed loading states.
ja: * **ロード中状態の表示を注意深く設計することが容易になります**。

source: ** It doesn't say _how_ the data is fetched, but it lets you closely control the visual loading sequence of your app.
ja: サスペンスは*どのように*データが取得されるのかについて関知しませんが、アプリケーションのローディングシーケンスを細かく制御することができるようになります。

source: * **It helps you avoid race conditions.
ja: * **競合状態 (race condition) を避ける手助けになります。

source: ** Even with `await`, asynchronous code is often error-prone.
ja: **`await` を使っていてすら、非同期のコードはエラーを起こしがちです。

source: Suspense feels more like reading data *synchronously* — as if it were already loaded.
ja: サスペンスを使うことで、データが*同期的に*読み出されているかのように、まるで既にロード済みであるかのように感じられます。

source: ## Using Suspense in Practice {#using-suspense-in-practice}
ja: ## 現実環境でのサスペンスの使用 {#using-suspense-in-practice}

source: At Facebook, so far we have only used the Relay integration with Suspense in production.
ja: Facebook では今のところ、本番環境において Relay のサスペンス連携機能のみを利用しています。

source: **If you're looking for a practical guide to get started today, [check out the Relay Guide](https://relay.dev/docs/en/experimental/step-by-step)!
ja: **今すぐ始めるための実用的なガイドが見たい場合は、[Relay のガイドをご覧ください](https://relay.dev/docs/en/experimental/step-by-step)！

source: ** It demonstrates patterns that have already worked well for us in production.
ja: ** 本番環境で既にうまく動作しているパターンについて述べられています。

source: **The code demos on this page use a "fake" API implementation rather than Relay.
ja: **このページのコードデモでは Relay ではなくフェイクの API 実装を使っています。

source: ** This makes them easier to understand if you're not familiar with GraphQL, but they won't tell you the "right way" to build an app with Suspense.
ja: **このため GraphQL に馴染みがない場合でも理解しやすくなっていますが、サスペンスを使ってアプリケーションを構築するための「正しいやり方」については述べていません。

source: This page is more conceptual and is intended to help you see *why* Suspense works in a certain way, and which problems it solves.
ja: このページは概念的なものであり、サスペンスが*なぜ*このように動作し、どんな問題を解決するのかについて理解できるようにすることを目的としています。

source: ### What If I Don't Use Relay?
ja: ### Relay を使ってない場合は？

source: If you don't use Relay today, you might have to wait before you can really try Suspense in your app.
ja: 今 Relay を使っていないのなら、サスペンスをあなたのアプリケーションで使うのは待った方がいいかもしれません。

source: So far, it's the only implementation that we tested in production and are confident in.
ja: 現在のところ、Relay が本番環境でテストされ、我々が自信を持っている唯一の実装です。

source: Over the next several months, many libraries will appear with different takes on Suspense APIs.
ja: この先の数か月で、サスペンスの API を様々な方法で利用した多くのライブラリが登場することでしょう。

source: **If you prefer to learn when things are more stable, you might prefer to ignore this work for now, and come back when the Suspense ecosystem is more mature.**
ja: **もっと安定したものを学びたいという人は、我々の作業を今のところは無視して、サスペンス周りのエコシステムが成熟してから戻ってくるのが良いかもしれません。**

source: You can also write your own integration for a data fetching library, if you'd like.
ja: 望むのであれば、データ取得ライブラリに対するあなた独自の連携機能を書くことは可能です。

source: ### For Library Authors {#for-library-authors}
ja: ### ライブラリ作者向け情報 {#for-library-authors}

source: We expect to see a lot of experimentation in the community with other libraries.
ja: これからコミュニティ内で他のライブラリを使った多くの実験がなされると思います。

source: There is one important thing to note for data fetching library authors.
ja: ライブラリ作者が覚えておいて欲しい重要なことが 1 つあります。

source: Although it's technically doable, Suspense is **not** currently intended as a way to start fetching data when a component renders.
ja: 技術的には可能ですが、サスペンスはコンポーネントがレンダーされてからデータ取得を開始するための方法であることを意図して*いません*。

source: Rather, it lets components express that they're "waiting" for data that is *already being fetched*.
ja: そうではなく、*既に取得されつつある*データに対して、コンポーネントがそれを「待機」中であると宣言できるようにします。

source: **[Building Great User Experiences with Concurrent Mode and Suspense](/blog/2019/11/06/building-great-user-experiences-with-concurrent-mode-and-suspense.html) describes why this matters and how to implement this pattern in practice.**
ja: **[Building Great User Experiences with Concurrent Mode and Suspense](/blog/2019/11/06/building-great-user-experiences-with-concurrent-mode-and-suspense.html) で、なぜこのことが重要で、実際にどう実装すればよいのかについて説明しています。**

source: Unless you have a solution that helps prevent waterfalls, we suggest to prefer APIs that favor or enforce fetching before render.
ja: ウォーターフォール (waterfall) の問題を回避できるソリューションをお持ちなのでない限り、レンダー前にデータ取得を行うことを推奨する、あるいは強制するような API が望ましいと考えています。

source: For a concrete example, you can look at how [Relay Suspense API](https://relay.dev/docs/en/experimental/api-reference#usepreloadedquery) enforces preloading.
ja: 具体例として、[Relay Suspense API](https://relay.dev/docs/en/experimental/api-reference#usepreloadedquery) がどのようにプリロードを強制するのかについて見ることができます。

source: Our messaging about this hasn't been very consistent in the past.
ja: ここでの我々のメッセージは、過去にはあまり一貫したものではありませんでした。

source: Suspense for Data Fetching is still experimental, so you can expect our recommendations to change over time as we learn more from production usage and understand the problem space better.
ja: サスペンスによるデータ取得はまだ実験的なものであり、我々が本番環境での使用のされ方について学び、この問題領域についてより理解するに従って、我々の推奨も変わるかもしれません。

source: ## Traditional Approaches vs Suspense {#traditional-approaches-vs-suspense}
ja: ## 既存アプローチ vs サスペンス {#traditional-approaches-vs-suspense}

source: We could introduce Suspense without mentioning the popular data fetching approaches.
ja: すでに人気のあるデータ取得のアプローチについて言及せずにサスペンスを紹介することもできたでしょう。

source: However, this makes it more difficult to see which problems Suspense solves, why these problems are worth solving, and how Suspense is different from the existing solutions.
ja: しかしそれでは、サスペンスがどのような問題を解決するのか、なぜそれが解決すべき問題なのか、これまでの方法とどう違うのか、といったことが分かりづらくなってしまいます。

source: Instead, we'll look at Suspense as a logical next step in a sequence of approaches:
ja: 代わりに、サスペンスのことを、これまでのアプローチの理論的な後継ステップとして見ていくことにします。

source: * **Fetch-on-render (for example, `fetch` in `useEffect`):** Start rendering components.
ja: * **Fetch-on-render（例：`useEffect` 内で `fetch`）：**コンポーネントのレンダーを開始する。

source: Each of these components may trigger data fetching in their effects and lifecycle methods.
ja: これらのコンポーネントがそれぞれ副作用やライフサイクルメソッド内でデータの取得をトリガする。

source: This approach often leads to "waterfalls".
ja: このアプローチはしばしば "ウォーターフォール" の問題を引き起こす。

source: * **Fetch-then-render (for example, Relay without Suspense):** Start fetching all the data for the next screen as early as possible.
ja: * **Fetch-then-render（例：サスペンスなしの Relay）：**次の画面のためのデータの取得をできるだけ早く開始する。

source: When the data is ready, render the new screen.
ja: データの準備が整ったら、新しい画面をレンダーする。

source: We can't do anything until the data arrives.
ja: データが到着するまで何も行えない。

source: * **Render-as-you-fetch (for example, Relay with Suspense):** Start fetching all the required data for the next screen as early as possible, and start rendering the new screen *immediately — before we get a network response*.
ja: * **Render-as-you-fetch（例：サスペンスを使った Relay）：**次の画面のためのデータの取得をできるだけ早く開始し、そして**直後に、つまりネットワークのレスポンスが得られる前に**新しい画面のレンダーを開始する。

source: As data streams in, React retries rendering components that still need data until they're all ready.
ja: データが順に到着するにつれて、React はデータが必要なコンポーネントのレンダーを繰り返し、最終的にすべてが描画済みとなる。

source: >Note > >This is a bit simplified, and in practice solutions tend to use a mix of different approaches.
ja: >補足： > >これはやや簡略化された説明であり、現実のソリューションでは複数のアプローチが混在する傾向にあります。

source: Still, we will look at them in isolation to better contrast their tradeoffs.
ja: それでも、それぞれのトレードオフを対比するためにこれらを別々に考えることにします。

source: To compare these approaches, we'll implement a profile page with each of them.
ja: これらのアプローチを比較するためにそれぞれの手法でプロフィールページを作成します。

source: ### Approach 1: Fetch-on-Render (not using Suspense) {#approach-1-fetch-on-render-not-using-suspense}
ja: ### アプローチ 1: Fetch-on-Render（サスペンス不使用）{#approach-1-fetch-on-render-not-using-suspense}

source: A common way to fetch data in React apps today is to use an effect:
ja: 現在の React アプリケーションでデータを取得する一般的な方法は副作用 (effect) を使用することです：

source: We call this approach "fetch-on-render" because it doesn't start fetching until *after* the component has rendered on the screen.
ja: 画面上にコンポーネントがレンダーされた**後**までデータ取得が始まらないので、このアプローチのことを "fetch-on-render" と呼ぶことにします。

source: This leads to a problem known as a "waterfall".
ja: これは "ウォーターフォール" と呼ばれる問題を引き起こします。

source: Consider these `<ProfilePage>` and `<ProfileTimeline>` components:
ja: 以下の `<ProfilePage>` と `<ProfileTimeline>` のコンポーネントを考えてみましょう：

source: **[Try it on CodeSandbox](https://codesandbox.io/s/fragrant-glade-8huj6)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/fragrant-glade-8huj6)**

source: If you run this code and watch the console logs, you'll notice the sequence is:
ja: このコードを実行してコンソールのログで眺めると、実行の順番は以下のようになっています：

source: We start fetching user details 2.
ja: ユーザ詳細情報の取得を開始 2.

source: We wait... 3.
ja: 待機する… 3.

source: We finish fetching user details 4.
ja: ユーザ詳細情報の取得が完了 4.

source: We start fetching posts 5.
ja: タイムライン投稿 (posts) の取得を開始 5.

source: We wait... 6.
ja: 待機する… 6.

source: We finish fetching posts
ja: 投稿の取得が完了

source: If fetching user details takes three seconds, we'll only *start* fetching the posts after three seconds!
ja: ユーザ詳細情報の取得に 3 秒かかる場合、投稿の取得の*開始*が 3 秒後になってしまいます！

source: That's a "waterfall": an unintentional *sequence* that should have been parallelized.
ja: これが「ウォーターフォール」、つまり並列化可能にもかかわらず意図せず混入してしまった*シーケンス*です。

source: Waterfalls are common in code that fetches data on render.
ja: レンダー時にデータを取得するコードではウォーターフォールはよく発生します。

source: They're possible to solve, but as the product grows, many people prefer to use a solution that guards against this problem.
ja: 修正することは可能ですが、プロダクトが成長するにつれて多くの人はこの問題を解決しづらくするような手法を使うようになります。

source: ### Approach 2: Fetch-Then-Render (not using Suspense) {#approach-2-fetch-then-render-not-using-suspense}
ja: ### アプローチ 2: Fetch-Then-Render（サスペンス不使用）{#approach-2-fetch-then-render-not-using-suspense}

source: Libraries can prevent waterfalls by offering a more centralized way to do data fetching.
ja: ライブラリは、より中央集権的なデータ取得の方法を提供することで、ウォーターフォールを防止することができます。

source: For example, Relay solves this problem by moving the information about the data a component needs to statically analyzable *fragments*, which later get composed into a single query.
ja: 例えば、Relay はコンポーネントが必要とするデータを静的に解析可能な*フラグメント*に移動し、あとでそれを単一のクエリに組み合わせる、という方法でこの問題を解決します。

source: On this page, we don't assume knowledge of Relay, so we won't be using it for this example.
ja: このページでは Relay の知識があることを前提としていませんので、この例では使いません。

source: Instead, we'll write something similar manually by combining our data fetching methods:
ja: 代わりに、2 つのデータ取得メソッドを組み合わせて似たようなものを手書きします：

source: In this example, `<ProfilePage>` waits for both requests but starts them in parallel:
ja: この例では `<ProfilePage>` は両方のリクエストを待機しますが、それらを同時に開始しています：

source: **[Try it on CodeSandbox](https://codesandbox.io/s/wandering-morning-ev6r0)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/wandering-morning-ev6r0)**

source: The event sequence now becomes like this:
ja: これで、イベントの流れは以下のようなものになります：

source: We start fetching posts 3.
ja: タイムライン投稿の取得を開始 3.

source: We wait... 4.
ja: 待機する… 4.

source: We finish fetching user details 5.
ja: ユーザ詳細情報の取得が完了 5.

source: We've solved the previous network "waterfall", but accidentally introduced a different one.
ja: これにより前述のネットワークの "ウォーターフォール" が解決されましたが、うっかり別のウォーターフォールができてしまいました。

source: We wait for *all* data to come back with `Promise.all()` inside `fetchProfileData`, so now we can't render profile details until the posts have been fetched too.
ja: `fetchProfileData` の内部で `Promise.all()` を使って*すべて*のデータが到着するまで待機しているので、投稿がロードされるまでプロフィール詳細画面をレンダーすることができないのです。

source: We have to wait for both.
ja: 両方を待つ必要があります。

source: Of course, this is possible to fix in this particular example.
ja: この特定の例に関して言えば、もちろん修正は可能です。

source: We could remove the `Promise.all()` call, and wait for both Promises separately.
ja: `Promise.all()` を除去して両方の Promise を個別に待つようにすればいいのです。

source: However, this approach gets progressively more difficult as the complexity of our data and component tree grows.
ja: しかし、データやコンポーネントツリーの複雑性が増すにつれて、このような手法はだんだんと困難になっていきます。

source: It's hard to write reliable components when arbitrary parts of the data tree may be missing or stale.
ja: データツリーのどこかが欠けていたり古くなっていたりしている場合、信頼できるコンポーネントを書くのは困難です。

source: So fetching all data for the new screen and *then* rendering is often a more practical option.
ja: なので新しい画面に必要なデータが全部到着した*後で*レンダーをする、というのがしばしば現実的な選択肢になります。

source: ### Approach 3: Render-as-You-Fetch (using Suspense) {#approach-3-render-as-you-fetch-using-suspense}
ja: ### アプローチ 3: Render-as-You-Fetch（サスペンスを使用）{#approach-3-render-as-you-fetch-using-suspense}

source: In the previous approach, we fetched data before we called `setState`:
ja: これまでのアプローチでは、`setState` を呼び出す前にデータを取得していました：

source: Start fetching 2.
ja: データ取得を開始 2.

source: Finish fetching 3.
ja: データ取得が完了 3.

source: Start rendering
ja: レンダーを開始

source: With Suspense, we still start fetching first, but we flip the last two steps around:
ja: サスペンスを使うと、データ取得をまず開始しますが、最後の 2 つのステップが入れ替わります：

source: **Start rendering** 3.
ja: **レンダーを開始** 3.

source: **Finish fetching**
ja: **データ取得が完了**

source: **With Suspense, we don't wait for the response to come back before we start rendering.** In fact, we start rendering *pretty much immediately* after kicking off the network request:
ja: **サスペンスを使うと、レンダーを始める前にレスポンスが返ってくるのを待つ必要がなくなります。**むしろ、ネットワークリクエストを叩いた*その直後*にレンダーを開始します。

source: Here's what happens when we render `<ProfilePage>` on the screen:
ja: 画面の `<ProfilePage>` をレンダーしたときに起こるのは以下のようなことです：

source: We've already kicked off the requests in `fetchProfileData()`.
ja: レンダー時点で `fetchProfileData()` を使ってリクエストがスタートしています。

source: It gave us a special "resource" instead of a Promise.
ja: この関数は Promise ではなく特殊な "リソース (resource)" を返します。

source: In a realistic example, it would be provided by our data library's Suspense integration, like Relay.
ja: 現実的な例では、Relay のようなデータ取得ライブラリのサスペンス連携機能を使うことになります。

source: React tries to render `<ProfilePage>`.
ja: React は `<ProfilePage>` のレンダーを試みます。

source: It returns `<ProfileDetails>` and `<ProfileTimeline>` as children.
ja: 子要素として `<ProfileDetails>` と `<ProfileTimeline>` が返ります。

source: React tries to render `<ProfileDetails>`.
ja: React は `<ProfileDetails>` のレンダーを試みます。

source: It calls `resource.user.read()`.
ja: 内部で `resource.user.read()` が呼び出されます。

source: None of the data is fetched yet, so this component "suspends".
ja: データはまだ何も取得されていないので、このコンポーネントは "サスペンド (suspend)" します。

source: React skips over it, and tries rendering other components in the tree.
ja: React はこのコンポーネントを飛ばして、ツリーの他のコンポーネントのレンダーを試みます。

source: React tries to render `<ProfileTimeline>`.
ja: React は `<ProfileTimeline>` のレンダーを試みます。

source: It calls `resource.posts.read()`.
ja: 内部で `resource.posts.read()` が呼び出されます。

source: Again, there's no data yet, so this component also "suspends".
ja: 今回も、まだデータがありませんので、このコンポーネントは "サスペンド" します。

source: React skips over it too, and tries rendering other components in the tree.
ja: React はこのコンポーネントも飛ばして、ツリーの他のコンポーネントのレンダーを試みます。

source: There's nothing left to try rendering.
ja: レンダーを試みるべき他のコンポーネントは残っていません。
